## IBM 직원 퇴사 데이터 분석

### Business Understanding (비즈니스이해)

#### **문제**

* 직원 퇴사율 증가

#### **가설**

* 나이가 어린 직원일수록 퇴사(이직)할 가능성이 높을 것이다.
* 출장 빈도가 높은 직원일수록 퇴사(이직)할 가능성이 높을 것이다.
* 월급이 낮은 직원일수록 퇴사(이직)할 가능성이 높을 것이다.
* 급여 인상률이 낮은 직원일수록 퇴사(이직)할 가능성이 높을 것이다.
* 스톡 옵션이 낮은 직원일수록 퇴사(이직)할 가능성이 높을 것이다.
* 집에서부터 회사까지의 거리가 먼 직원일수록 퇴사(이직)할 가능성이 높을 것이다.
* 업무 환경 만족도/직무 만족도/동료와의 관계 만족도가 낮은 직원일수록 퇴사(이직)할 가능성이 높을 것이다.
* 야근을 자주 하는 직원일수록 퇴사(이직)할 가능성이 높을 것이다.
* 워라벨이 낮은 직원일수록 퇴사(이직)할 가능성이 높을 것이다.
* 미혼/이혼 상태인 직원의 퇴사(이직) 가능성이 높을 것이다.
* 결혼한 여성의 경우 출산 후 퇴사 가능성이 높을 것이다.

### Data Understanding (데이터 이해)

#### **Column**
* Y : Attrition (퇴사 여부)
* X
    * Age (나이)
    * BusinessTravel (출장 빈도)
    * DailyRate (일일 급여)
    * Department (부서)
    * DistanceFromHome (집에서부터 회사까지의 거리)
    * Education (학력 -> 1: Below College, 2: College, 3: Bachelor, 4: Master, 5: Doctor)
    * EducationField (전공)
    * EmployeeCount (직원 수 -> 전부 1)
    * EmployeeNumber (직원 고유 번호)
    * EnvironmentSatisfaction (업무 환경 만족도 -> 1: Low, 2: Medium, 3: High, 4: Very High)
    * Gender (성별)
    * HourlyRate (시급)
    * JobInvolvement (직무 참여도 -> 1: Low, 2: Medium, 3: High, 4: Very High)
    * JobLevel (직급)
    * JobRole (직무)
    * JobSatisfaction (직무 만족도 -> 1: Low, 2: Medium, 3: High, 4: Very High)
    * MaritalStatus (결혼 여부)
    * MonthlyIncome (월 소득)
    * MonthlyRate (월급)
    * NumCompaniesWorked (근무한 회사 수)
    * Over18 (18세 이상 여부 -> 전부 Y)
    * OverTime (야근)
    * PercentSalaryHike (급여 인상률)
    * PerformanceRating (성과 등급 -> 1: Low, 2: Medium, 3: High, 4: Very High)
    * RelationshipSatisfaction (동료와의 관계 만족도 -> 1: Low, 2: Medium, 3: High, 4: Very High)
    * StandardHours (근무 시간 -> 전부 80)
    * StockOptionLevel (스톡 옵션)
    * TotalWorkingYears (경력 기간)
    * TrainingTimesLastYear (지난해 받은 교육 시간)
    * WorkLifeBalance (워라벨 -> 1: Low, 2: Medium, 3: High, 4: Very High)
    * YearsAtCompany (근속 연수)
    * YearsInCurrentRole (현재 직무 경력 기간)
    * YearsSinceLastPromotion (마지막 승진 이후 경과된 시간)
    * YearsWithCurrManager (현재 관리자와 함께 일한 기간)

In [2]:
# 라이브러리 로딩
import pandas as pd

In [3]:
# 데이터 로딩
data = pd.read_csv('./employee_attrition.csv')
data.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

In [4]:
# 데이터 요약 확인
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1470 non-null   int64
 1   Attrition                 1470 non-null   object
 2   BusinessTravel            1470 non-null   object
 3   DailyRate                 1470 non-null   int64
 4   Department                1470 non-null   object
 5   DistanceFromHome          1470 non-null   int64
 6   Education                 1470 non-null   int64
 7   EducationField            1470 non-null   object
 8   EmployeeCount             1470 non-null   int64
 9   EmployeeNumber            1470 non-null   int64
 10  EnvironmentSatisfaction   1470 non-null   int64
 11  Gender                    1470 non-null   object
 12  HourlyRate                1470 non-null   int64
 13  JobInvolvement            1470 non-null   int64
 14  JobLevel                  1470 non-null   int64
 15  JobRole                   1470 non-null   object
 16  JobSatisfaction           1470 non-null   int64
 17  MaritalStatus             1470 non-null   object
 18  MonthlyIncome             1470 non-null   int64
 19  MonthlyRate               1470 non-null   int64
 20  NumCompaniesWorked        1470 non-null   int64
 21  Over18                    1470 non-null   object
 22  OverTime                  1470 non-null   object
 23  PercentSalaryHike         1470 non-null   int64
 24  PerformanceRating         1470 non-null   int64
 25  RelationshipSatisfaction  1470 non-null   int64
 26  StandardHours             1470 non-null   int64
 27  StockOptionLevel          1470 non-null   int64
 28  TotalWorkingYears         1470 non-null   int64
 29  TrainingTimesLastYear     1470 non-null   int64
 30  WorkLifeBalance           1470 non-null   int64
 31  YearsAtCompany            1470 non-null   int64
 32  YearsInCurrentRole        1470 non-null   int64
 33  YearsSinceLastPromotion   1470 non-null   int64
 34  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 402.1+ KB

#### **2024.02.23 복습**

In [5]:
# 컬럼 확인
list(data)

['Age',
 'Attrition',
 'BusinessTravel',
 'DailyRate',
 'Department',
 'DistanceFromHome',
 'Education',
 'EducationField',
 'EmployeeCount',
 'EmployeeNumber',
 'EnvironmentSatisfaction',
 'Gender',
 'HourlyRate',
 'JobInvolvement',
 'JobLevel',
 'JobRole',
 'JobSatisfaction',
 'MaritalStatus',
 'MonthlyIncome',
 'MonthlyRate',
 'NumCompaniesWorked',
 'Over18',
 'OverTime',
 'PercentSalaryHike',
 'PerformanceRating',
 'RelationshipSatisfaction',
 'StandardHours',
 'StockOptionLevel',
 'TotalWorkingYears',
 'TrainingTimesLastYear',
 'WorkLifeBalance',
 'YearsAtCompany',
 'YearsInCurrentRole',
 'YearsSinceLastPromotion',
 'YearsWithCurrManager']

In [11]:
# unique() : 고유 값 확인
print(data['BusinessTravel'].unique())  # ['Travel_Rarely' 'Travel_Frequently' 'Non-Travel']
print(data['Department'].unique())  # ['Sales' 'Research & Development' 'Human Resources']
print(data['MaritalStatus'].unique())  # ['Single' 'Married' 'Divorced']

['Travel_Rarely' 'Travel_Frequently' 'Non-Travel']
['Sales' 'Research & Development' 'Human Resources']
['Single' 'Married' 'Divorced']

In [13]:
# value_counts() : 고유 값 개수 확인
data['JobRole'].value_counts()

JobRole
Sales Executive              326
Research Scientist           292
Laboratory Technician        259
Manufacturing Director       145
Healthcare Representative    131
Manager                      102
Sales Representative          83
Research Director             80
Human Resources               52
Name: count, dtype: int64

In [16]:
# sort_values(by='', ascending=) : 데이터 정렬
data.sort_values(by='MonthlyIncome', ascending=False)[['Age', 'MonthlyIncome']].head(3)

     Age  MonthlyIncome
190   52          19999
746   41          19973
851   56          19943

In [21]:
# loc[행 조건, 열 이름]
data.loc[data['BusinessTravel'] == 'Travel_Frequently', 'Department']

1       Research & Development
3       Research & Development
5       Research & Development
8       Research & Development
26      Research & Development
                 ...
1440    Research & Development
1452                     Sales
1456    Research & Development
1465    Research & Development
1468                     Sales
Name: Department, Length: 277, dtype: object

In [33]:
# 나이가 30 이상이면서 결혼한 여성의 ['Attrition', 'Age'] 조회
data.loc[(data['Age'] >= 30) & (data['MaritalStatus'] == 'Married') & (data['Gender'] == 'Female'), ['Attrition', 'Age']]

     Attrition  Age
3           No   33
6           No   59
18          No   53
28          No   44
37          No   35
...        ...  ...
1451        No   38
1453        No   36
1457        No   40
1458        No   35
1462        No   39

[225 rows x 2 columns]

In [51]:
# between(a, b, inclusive='left/right/both/neither') (DistanceFromHome이 15이상 30이하인 직원의 'Attrition' 조회)
original_data.loc[original_data['DistanceFromHome'].between(15, 30), 'Attrition']

7        No
8        No
9        No
10       No
11       No
       ...
1456     No
1460     No
1461    Yes
1462     No
1465     No
Name: Attrition, Length: 355, dtype: object

In [40]:
# isin([val1, val2, val3, ...])
data.loc[data['JobSatisfaction'].isin([4, 5]), ['JobSatisfaction', 'WorkLifeBalance']]

      JobSatisfaction  WorkLifeBalance
0                   4                1
5                   4                2
13                  4                3
17                  4                2
18                  4                3
...               ...              ...
1451                4                3
1453                4                2
1458                4                3
1462                4                2
1465                4                3

[459 rows x 2 columns]

In [31]:
# 집계 함수 mean()
round(data.loc[data['Attrition'] == 'Yes', 'Age'].mean())

34

In [26]:
# 집계 함수 count()
total_employee = data.loc[:, 'EmployeeNumber'].count()
attrition = data.loc[data['Attrition'] == 'Yes', 'EmployeeNumber'].count()
print(f'{attrition / total_employee * 100 : .3f}%')

 16.122%

In [52]:
# groupby('집계기준변수', as_index=)['집계대상변수'].집계함수
data.loc[data['Attrition'] == 'Yes'].groupby('MaritalStatus', as_index=False)['EmployeeNumber'].count()

  MaritalStatus  EmployeeNumber
0      Divorced              33
1       Married              84
2        Single             120

In [53]:
data.groupby(['JobRole', 'Attrition'], as_index=False)['EmployeeNumber'].count()

                      JobRole Attrition  EmployeeNumber
0   Healthcare Representative        No             122
1   Healthcare Representative       Yes               9
2             Human Resources        No              40
3             Human Resources       Yes              12
4       Laboratory Technician        No             197
5       Laboratory Technician       Yes              62
6                     Manager        No              97
7                     Manager       Yes               5
8      Manufacturing Director        No             135
9      Manufacturing Director       Yes              10
10          Research Director        No              78
11          Research Director       Yes               2
12         Research Scientist        No             245
13         Research Scientist       Yes              47
14            Sales Executive        No             269
15            Sales Executive       Yes              57
16       Sales Representative        No              50
17       Sales Representative       Yes              33

In [57]:
# 직무 별 평균 월 수입, 직급, 야근, 근속 연수
data.groupby('JobRole', as_index=False)[['MonthlyIncome', 'JobLevel', 'YearsAtCompany']].mean()

                     JobRole  MonthlyIncome  JobLevel  YearsAtCompany
0  Healthcare Representative    7528.763359  2.473282        8.374046
1            Human Resources    4235.750000  1.480769        5.326923
2      Laboratory Technician    3237.169884  1.239382        5.019305
3                    Manager   17181.676471  4.303922       14.431373
4     Manufacturing Director    7295.137931  2.448276        7.600000
5          Research Director   16033.550000  3.975000       10.937500
6         Research Scientist    3239.972603  1.202055        5.113014
7            Sales Executive    6924.279141  2.328221        7.496933
8       Sales Representative    2626.000000  1.084337        2.915663

In [58]:
# 나이별 월 소득의 최댓값, 최솟값, 평균 조회하기
data.groupby('Age', as_index=False)['MonthlyIncome'].agg(['min', 'max', 'mean'])

    Age   min    max          mean
0    18  1051   1904   1518.375000
1    19  1102   2994   2075.000000
2    20  1009   3033   2539.363636
3    21  1232   3447   2491.461538
4    22  2244   4775   2950.000000
5    23  1223   3989   2515.357143
6    24  1555   4999   3243.923077
7    25  1118   8639   4144.769231
8    26  2007   6397   3531.487179
9    27  1706  12808   4190.416667
10   28  1052   9854   3904.833333
11   29  1091  16124   4584.411765
12   30  1081  11916   4814.850000
13   31  1129  16422   5525.391304
14   32  1393  11244   5092.459016
15   33  2008  17444   5500.500000
16   34  2008  17007   5269.220779
17   35  1281  11996   5425.282051
18   36  2013  11713   5590.913043
19   37  2073  13744   5853.860000
20   38  1702  13582   5721.586207
21   39  2086  19431   8183.357143
22   40  2001  19833   7700.947368
23   41  2107  19973   8379.825000
24   42  2093  19613   8074.847826
25   43  2089  19740   8444.937500
26   44  2011  19513   7114.333333
27   45  2132  19202   7811.219512
28   46  3423  19627  11457.969697
29   47  2105  19658   8931.416667
30   48  2259  19665   9344.789474
31   49  2587  19502   9952.875000
32   50  2380  19926  12697.166667
33   51  2075  19847   9632.473684
34   52  2950  19999  10606.888889
35   53  2306  19094  11564.157895
36   54  2897  19406  10875.833333
37   55  2662  19859  13204.181818
38   56  2066  19943   8248.357143
39   57  4900  14118   8803.000000
40   58  2372  19701  10705.785714
41   59  2177  18844   8038.100000
42   60  5220  19566  10268.000000

In [59]:
# 나이별 월 소득의 총합과 학력의 평균 조회하기
data.groupby('Age', as_index=False).agg({'MonthlyIncome': 'sum', 'Education': 'mean'})

    Age  MonthlyIncome  Education
0    18          12147   2.500000
1    19          18675   2.111111
2    20          27933   2.636364
3    21          32389   1.615385
4    22          47200   1.812500
5    23          35215   1.857143
6    24          84342   2.115385
7    25         107764   1.923077
8    26         137728   2.641026
9    27         201140   2.666667
10   28         187432   2.791667
11   29         311740   2.573529
12   30         288891   2.766667
13   31         381252   3.057971
14   32         310640   3.049180
15   33         319029   3.086207
16   34         405730   3.090909
17   35         423172   3.217949
18   36         385773   3.246377
19   37         292693   3.000000
20   38         331852   2.965517
21   39         343701   2.785714
22   40         438954   2.964912
23   41         335193   2.925000
24   42         371443   2.913043
25   43         270238   3.125000
26   44         234773   3.181818
27   45         320260   2.975610
28   46         378113   2.878788
29   47         214354   3.125000
30   48         177551   3.157895
31   49         238869   2.958333
32   50         380915   3.166667
33   51         183017   3.263158
34   52         190924   3.222222
35   53         219719   3.052632
36   54         195765   3.500000
37   55         290492   3.000000
38   56         115477   3.214286
39   57          35212   2.750000
40   58         149881   3.357143
41   59          80381   2.800000
42   60          51340   3.600000

#### **컬럼 삭제**

'MonthlyIncome'과 중복되는 'DailyRate', 'HourlyRate', 'MonthlyRate' 컬럼과, 
<br>
모든 직원이 동일한 값을 가지고 있는 'EmployeeCount', 'Over18', 'StandardHours'는 고려하지 않는다.

In [60]:
data2 = data.copy()

data2.drop(['DailyRate', 'HourlyRate', 'MonthlyRate', 'EmployeeCount', 'Over18', 'StandardHours'], axis=1, inplace=True)
data2

,Age,Attrition,BusinessTravel,Department,DistanceFromHome,Education,EducationField,EmployeeNumber,EnvironmentSatisfaction,Gender,...,PerformanceRating,RelationshipSatisfaction,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,Sales,1,2,Life Sciences,1,2,Female,...,3,1,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,Research & Development,8,1,Life Sciences,2,3,Male,...,4,4,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,Research & Development,2,2,Other,4,4,Male,...,3,2,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,Research & Development,3,4,Life Sciences,5,4,Female,...,3,3,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,Research & Development,2,1,Medical,7,1,Male,...,3,4,1,6,3,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,36,No,Travel_Frequently,Research & Development,23,2,Medical,2061,3,Male,...,3,3,1,17,3,3,5,2,0,3
1466,39,No,Travel_Rarely,Research & Development,6,1,Medical,2062,4,Male,...,3,1,1,9,5,3,7,7,1,7
1467,27,No,Travel_Rarely,Research & Development,4,3,Life Sciences,2064,2,Male,...,4,2,1,6,0,3,6,2,0,3
1468,49,No,Travel_Frequently,Sales,2,3,Medical,2065,4,Male,...,3,4,0,17,3,2,9,6,0,8
1469,34,No,Travel_Rarely,Research & Development,8,3,Medical,2068,2,Male,...,3,1,0,6,3,4,4,3,1,2